# Luke Symes
## Week 13/14 04/25/2021
### Python - Pandas DataFrame - Grouping and Mapping

In [1]:
import numpy as np

from pandas import Series, DataFrame
import pandas as pd

In [2]:
#mapping
df =DataFrame({'city':['Alma','Brian','Fox Park','Lake Mary'],
              'altitude':[10355,9800,9062,8966]})
df

        city  altitude
0       Alma     10355
1      Brian      9800
2   Fox Park      9062
3  Lake Mary      8966

In [4]:
st_map={'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming','Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [6]:
df['state'] = df['city'].map(st_map)
df

        city  altitude       state
0       Alma     10355    Colorado
1      Brian      9800         NaN
2   Fox Park      9062     Wyoming
3  Lake Mary      8966  California

In [7]:
#apply
def meter(x):
    return x / 3.2808

In [8]:
df['altitude'] = df['altitude'].apply(meter)
df

        city     altitude       state
0       Alma  3156.242380    Colorado
1      Brian  2987.076323         NaN
2   Fox Park  2762.131188     Wyoming
3  Lake Mary  2732.870032  California

In [9]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
              index=['UT', 'OH', 'TX', 'OR'])
df

           b         d         e
UT -0.357200 -0.669274 -0.711431
OH -0.053035 -1.146485 -0.389741
TX -0.054990  1.567146 -0.501146
OR  0.295341  1.088398  0.395998

In [10]:
def dif(x):
    return x.max() - x.min()

In [11]:
df.apply(dif)

b    0.652540
d    2.713630
e    1.107429
dtype: float64

In [12]:
df.apply(dif, axis=1)

UT    0.354231
OH    1.093450
TX    2.068292
OR    0.793057
dtype: float64

In [14]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.146485  0.0  1.0  0.0
-0.711431  0.0  0.0  1.0
-0.669274  0.0  1.0  0.0
-0.501146  0.0  0.0  1.0
-0.389741  0.0  0.0  1.0
-0.357200  1.0  0.0  0.0
-0.054990  1.0  0.0  0.0
-0.053035  1.0  0.0  0.0
 0.295341  1.0  0.0  0.0
 0.395998  0.0  0.0  1.0
 1.088398  0.0  1.0  0.0
 1.567146  0.0  1.0  0.0

In [17]:
#groupby
df = DataFrame({'k1': ['a','a','b','b','c'],
               'k2': ['one','two','one','two','one'],
               'dataset1': np.random.rand(5),
               'dataset2': np.random.rand(5)})

df

  k1   k2  dataset1  dataset2
0  a  one  0.892664  0.752836
1  a  two  0.380073  0.534754
2  b  one  0.551475  0.899945
3  b  two  0.401403  0.368597
4  c  one  0.047656  0.952483

In [18]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [19]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [21]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [22]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.892664  0.752836
1  a  two  0.380073  0.534754
2  b  one  0.551475  0.899945
3  b  two  0.401403  0.368597
4  c  one  0.047656  0.952483

In [23]:
df['dataset1'].groupby(df['k1']).mean()

k1
a    0.636368
b    0.476439
c    0.047656
Name: dataset1, dtype: float64

In [24]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one  0.892664  0.752836
   two  0.380073  0.534754
b  one  0.551475  0.899945
   two  0.401403  0.368597
c  one  0.047656  0.952483

In [25]:
group = df.groupby(['k1','k2'])[['dataset1']]

group.mean()

        dataset1
k1 k2
a  one  0.892664
   two  0.380073
b  one  0.551475
   two  0.401403
c  one  0.047656